#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.single_zone.data.archive_file.warmer_function[0]: Reading...
module.single_zone.data.archive_file.image_optimisation_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Read complete after 0s [id=b990902132fc94a109ec2fa058fc29d2ef3b9b2e]
module.single_zone.data.archive_file.warmer_function[0]: Read complete after 0s [id=e5094e337d97bf663bebb451657f5785a9dda36d]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.single_zone.module.public_resources[0].data.aws_region.current: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_function.x_forwarded_host: Refreshing state... [id=vltech-website-x-forwarded-host-function]
module.single_zone.module.public_resources[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.http-redirect.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:615299762949:certificate/c69ccd6e-eece-4944-b5d5-e191ea5376aa]
module.single_zone.module.public_resources[0].aws_cloudfront_cache_policy.cache_policy[0]: Refreshing state... [id=06efa7e0-f0db-4669-832e-5b76036eb9b1]
module.single_zone.module.public_resources[0].aws_cloudfront_origin_access_control.website_origin_access_control: Refreshing state... [id=E3RNQ0V4MAIQ68]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Reading...
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Read complete after 0s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.single_zone.module.revalidation_function.data.aws_region.current: Reading...
module.single_zone.module.server_function.data.aws_caller_identity.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Reading...
module.single_zone.module.server_function.data.aws_region.current: Reading...
module.single_zone.module.image_optimisation_function[0].aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-image-optimization-function-role]
module.single_zone.module.server_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.revalidation_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-revalidation-function-role]
module.http-redirect.data.aws_route53_zone.zone: Reading...
module.single_zone.aws_sqs_queue.revalidation_queue: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/615299762949/vltech-website-isr-queue.fifo]
module.single_zone.module.revalidation_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.aws_dynamodb_table.isr_table[0]: Refreshing state... [id=vltech-website-isr-tag-mapping]
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Read complete after 0s [id=eu-central-1]
data.aws_caller_identity.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.open_next_aliases[0].aws_ssm_parameter.origin_aliases: Refreshing state... [id=vltech-website-website-origin-aliases]
module.single_zone.data.aws_region.current: Reading...
module.single_zone.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.http-redirect.aws_cloudfront_function.redirect: Refreshing state... [id=http-redirect]
module.single_zone.module.server_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-server-function-role]
module.single_zone.module.server_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Reading...
module.http-redirect.data.aws_route53_zone.zone: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.single_zone.aws_s3_bucket.bucket[0]: Refreshing state... [id=vltech-website-website-bucket]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
module.http-redirect.aws_route53_record.cert_validation["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA__abc41aced5334d86bdd43adac171c372.victorlevasseur.tech._CNAME]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Read complete after 1s [id=Z01305181G23H04WP32YA]
module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-revalidation-function]
module.single_zone.data.archive_file.image_optimisation_function[0]: Read complete after 1s [id=3ce2535a8d211a6d9f1ecbd43016cfb721c5b10e]
module.single_zone.module.image_optimisation_function[0].aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-image-optimization-function]
module.single_zone.module.revalidation_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-revalidation-function]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.server_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-server-function]
module.http-redirect.aws_acm_certificate_validation.cert: Refreshing state... [id=2025-02-13 14:11:52.205 +0000 UTC]
module.http-redirect.aws_cloudfront_distribution.distribution: Refreshing state... [id=E3AXV12PY17NPX]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Reading...
module.http-redirect.aws_route53_record.main["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_A]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Read complete after 0s [id=vltech-website-website-origin-aliases]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/_not-found"]: Refreshing state... [id=08b87655-3622-1341-52d0-7f659957392d]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/sitemap.xml"]: Refreshing state... [id=4b8bed6a-a889-65cc-35d1-5cbcba983064]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/sitemap.xml/route"]: Refreshing state... [id=3a2dc5d3-a7eb-c7ce-4127-6f9ad25f9db3]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/icon.svg/layout"]: Refreshing state... [id=1c01c793-08a4-5b79-035b-d43e1eb420b4]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/_not-found"]: Refreshing state... [id=7c1e1528-4da8-039c-e928-7a4593c837ed]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/apple-icon.png"]: Refreshing state... [id=aed44db3-c439-beae-2af9-6f30e84e9a32]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/icon.svg"]: Refreshing state... [id=62e4ae44-8741-c042-8261-5ea9cc607aa2]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/sitemap.xml"]: Refreshing state... [id=22db2b9c-9790-3fd9-2a9b-e23f24f2a18f]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/apple-icon.png"]: Refreshing state... [id=e2fd9900-2f1e-ec86-71ab-d983603fe2ba]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/cgv"]: Refreshing state... [id=ede44a60-9e42-368e-5a08-99f18dc122e2]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/cgv"]: Refreshing state... [id=89647507-8934-c9cd-0f37-c0d627d3e315]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/icon.svg"]: Refreshing state... [id=74e83015-dfbb-b663-c89e-079070adc117]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/favicon.ico/layout"]: Refreshing state... [id=2bf5c3a4-3ec9-8a57-6d8b-e59e774d4bce]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/favicon.ico"]: Refreshing state... [id=d74481e6-9223-4974-131e-9a42f0750782]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/favicon.ico"]: Refreshing state... [id=1368acd4-982f-31a4-6cfc-84ee060e1fa0]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/favicon.ico/route"]: Refreshing state... [id=2d86ece4-3308-b48c-94d2-937a75e263e4]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/"]: Refreshing state... [id=52efae60-6698-ebaa-d04e-6458380bc3a8]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/page"]: Refreshing state... [id=790925c4-03af-982c-a302-e372b6f968cb]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/cgv/layout"]: Refreshing state... [id=59d3fb79-82c9-18e8-d3b8-02a2f5063446]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/_not-found/page"]: Refreshing state... [id=68ffc3ca-64e3-2734-32b1-bc24ae7ceaff]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/cgv/page"]: Refreshing state... [id=62017a5c-ca73-97d2-0a37-901bf46724a7]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/sitemap.xml/layout"]: Refreshing state... [id=4e793313-1468-fa07-5600-e6fa234cf59c]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/index"]: Refreshing state... [id=83994787-8606-db65-4433-d03dc653d168]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/apple-icon.png/layout"]: Refreshing state... [id=ccdc4b01-de23-deae-3d23-818ba5e45baf]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/icon.svg/route"]: Refreshing state... [id=f3b56f68-21f6-7bbd-98e1-4c5c1669c010]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/_not-found/layout"]: Refreshing state... [id=af5f6174-7c39-201a-9a12-f6034d8faf27]
module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/apple-icon.png/route"]: Refreshing state... [id=4f8323af-0cdb-fc15-b2fb-49a499bb1aa8]
module.single_zone.module.revalidation_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-revalidation-function-lambda-policy]
module.single_zone.module.revalidation_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-revalidation-function-role-20241218205629363600000001]
module.single_zone.module.revalidation_function.aws_lambda_alias.lambda_alias["stable"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:stable]
module.single_zone.aws_lambda_event_source_mapping.revalidation_queue_source: Refreshing state... [id=23604771-f7d2-432b-ba67-c4d45c3c7817]
module.single_zone.module.revalidation_function.terraform_data.update_alias[0]: Refreshing state... [id=263b09c8-895a-2ee4-b293-064ed747e58b]
module.single_zone.module.revalidation_function.aws_lambda_function_url.function_url["stable"]: Refreshing state... [id=vltech-website-revalidation-function/stable]
module.single_zone.module.image_optimisation_function[0].aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-image-optimization-function-lambda-policy]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-image-optimization-function]
module.single_zone.data.archive_file.server_function[0]: Reading...
module.single_zone.module.s3_assets.terraform_data.file_sync["assets/vltech_logo.png"]: Refreshing state... [id=5580fd80-287a-0715-aa66-6da5c311462b]
module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/cgv.cache"]: Refreshing state... [id=cf7e5e26-2fa3-1017-9405-02c5a6c88703]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/122c360d7fe6d395-s.p.woff2"]: Refreshing state... [id=674ad872-ee9b-89bd-9252-351607ab6caf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/357398c3a461852b-s.woff2"]: Refreshing state... [id=e42276e7-9c0c-c131-fdcf-2a5abf5f7666]
module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/icon.svg.cache"]: Refreshing state... [id=1ccaf511-c967-55eb-898d-d77d50a9bed9]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-b5896372898a26b5.js"]: Refreshing state... [id=bc9d1baf-5248-765c-dec3-717d504374f3]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9f05b6a2725a7318-s.woff2"]: Refreshing state... [id=ac4a618e-66ed-1415-d02d-9d88a4c281ad]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/01b81fc6c4002686.css"]: Refreshing state... [id=de26967e-7b67-5a54-f6e4-3b45a00acb1c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/a8eac78432f0a60b-s.woff2"]: Refreshing state... [id=9e031051-5705-f03c-c644-4ca8b9261bf5]
module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/index.cache"]: Refreshing state... [id=e8a50cf1-70c7-0ae7-e6c7-3e649a98c606]
module.single_zone.module.s3_assets.terraform_data.file_sync["documents/cgv.pdf"]: Refreshing state... [id=c76dce72-1386-d74a-4047-b8fa9d7b4f05]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_error-9b7125ad1a1e68fa.js"]: Refreshing state... [id=75ef6842-85f2-603c-3c4b-cd67c9b9561f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/b32bc20a1e277f31-s.woff2"]: Refreshing state... [id=321d4549-ae06-3830-42eb-cfce7a6e73cf]
module.single_zone.module.s3_assets.terraform_data.file_sync["favicon.ico"]: Refreshing state... [id=d538d61d-dce0-cc44-df24-44711711892d]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/978-2e23e15eb2d9825e.js"]: Refreshing state... [id=08c3e02a-0a97-2c74-2cfe-bc127cd57f15]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/42aa6e6ea3b85651-s.woff2"]: Refreshing state... [id=59d3c0ee-ae3d-7390-a731-81f5168d647a]
module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/favicon.ico.cache"]: Refreshing state... [id=74d91445-2cc2-e7ac-c868-4759854d6217]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/bc270b3a577192a7-s.woff2"]: Refreshing state... [id=16b8f0c3-94b5-168f-1fc9-f51adc0e8a3c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/7bafef50a4560c1d-s.woff2"]: Refreshing state... [id=271e32ae-abf0-ca24-a29d-49260817d15a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9bbb7f84f3601865-s.woff2"]: Refreshing state... [id=325d0d9e-b078-18a5-55c7-a53c90d5c6d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-8afb5c88d2340613.js"]: Refreshing state... [id=466372c9-168c-2f72-f31f-51cac8590e83]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/173-fc558b54b5be890b.js"]: Refreshing state... [id=bae8c547-8fd3-1d15-a8aa-1e2e1fb9c4d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/apple-icon.png.cache"]: Refreshing state... [id=50428d05-e65a-f1d2-11b6-e63bee868587]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/cgv/page-2f9874ecc3099b18.js"]: Refreshing state... [id=34f45cf6-bb8a-9b44-d95d-0c917d12f956]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-a6eb4bce5bd8ed9b.js"]: Refreshing state... [id=2e38b1f6-e9cc-8645-2869-3d55b50564e3]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-dbf93d4b3b66ee0d.js"]: Refreshing state... [id=f70e794e-46fc-f612-0b45-1bcaab0b96a8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/4d1af68a2715a16a-s.p.woff2"]: Refreshing state... [id=e72e9c33-e3f8-1fde-1eb0-6a73205452e8]
module.single_zone.module.server_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-server-function-lambda-policy]
module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"]: Refreshing state... [id=a62f2a6c-f04c-9ae4-1cc3-c40d2cfdf75f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-b2447a23980919fd.js"]: Refreshing state... [id=86b17e9c-0ff0-125e-e384-6bbaf9c2d977]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/d0697bdd3fb49a78-s.woff2"]: Refreshing state... [id=9076105b-745e-e65e-ec39-f64e126aac2e]
module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/_not-found.cache"]: Refreshing state... [id=49f93e7a-a6d5-9be0-3b2f-6a2ce9e8d472]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-d4c84837250c81b8.js"]: Refreshing state... [id=fbe0b5a6-0ff9-f248-fb8d-1f39b44a8105]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/c740c1d45290834f-s.woff2"]: Refreshing state... [id=6c695a5c-d238-b55a-e737-abff99fcd32c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-47d8fb00497672e4.js"]: Refreshing state... [id=a6a618da-575c-c65c-ffec-d19aeebed804]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/b8022cc0231a4bfd.css"]: Refreshing state... [id=715e82b9-4752-4d03-4e14-bba9b5b369bd]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/polyfills-42372ed130431b0a.js"]: Refreshing state... [id=83abb4c2-13d6-9782-a9c9-1f886e23d3a1]
module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/sitemap.xml.cache"]: Refreshing state... [id=86428616-26ac-f751-53eb-9d91b885e428]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/382b6f43e60580be-s.woff2"]: Refreshing state... [id=02cd3ae0-21e8-4118-e990-2aebe2360167]
module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/500.cache"]: Refreshing state... [id=fc182b36-f08e-4025-f723-7a5213c9fa14]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/1EdMy2c0emGvHVZE3AZtq/_buildManifest.js"]: Refreshing state... [id=cd953d10-7d48-69f2-5d26-2f1ee076e489]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-984cbc839a680ab5.js"]: Refreshing state... [id=0326f31c-3e63-6c97-3dcd-1937ad8c78fc]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-c579319bb9b05615.js"]: Refreshing state... [id=ac913217-a6e6-32d9-66ab-7bca99b23029]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_app-d23763e3e6c904ff.js"]: Refreshing state... [id=a0a95740-9bd1-bbc5-3088-e6e5d18fff57]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/1EdMy2c0emGvHVZE3AZtq/_ssgManifest.js"]: Refreshing state... [id=daeaa53e-505e-7272-f74e-67fc6be59edd]
module.single_zone.module.image_optimisation_function[0].aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-image-optimization-function-role-20241218205750570200000002]
module.single_zone.module.server_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-server-function-role-20241218205750451600000001]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:nextjs]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205755531800000003]
module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0]: Refreshing state... [id=61b6fd4d-844e-7712-5ed4-6a3cb3056c54]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-image-optimization-function/opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-image-optimization-function/nextjs]
module.single_zone.data.archive_file.server_function[0]: Read complete after 1s [id=d21f2182c59d092273380eeec6e5400fb67ab8d3]
module.single_zone.module.server_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-server-function]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:opennext]
module.single_zone.module.server_function.aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205803707400000004]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:nextjs]
module.single_zone.module.server_function.terraform_data.update_alias[0]: Refreshing state... [id=01927d7d-58b0-93df-31d1-839c889c95aa]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-server-function/nextjs]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-server-function/opennext]
module.single_zone.module.public_resources[0].aws_cloudfront_distribution.production_distribution[0]: Refreshing state... [id=EU3DKQFOTEI79]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_A]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_AAAA]
module.single_zone.terraform_data.update_aliases[0]: Refreshing state... [id=49c58d79-1f33-2d00-f3ea-d2bf33d20bfb]
module.single_zone.aws_s3_bucket_policy.bucket_policy[0]: Refreshing state... [id=vltech-website-website-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "52efae60-6698-ebaa-d04e-6458380bc3a8" -> null
      - triggers_replace = [
          - "nextjs",
          - "23046e431fc9eecaaf512f48dfac59b4",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/_not-found"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "08b87655-3622-1341-52d0-7f659957392d" -> null
      - triggers_replace = [
          - "nextjs",
          - "3386eb11b76a7a0bab2741cd825874c6",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/_not-found/layout"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/_not-found/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "af5f6174-7c39-201a-9a12-f6034d8faf27" -> null
      - triggers_replace = [
          - "nextjs",
          - "47194e108cff11e9f4fed273713f73ba",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/_not-found/page"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/_not-found/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "68ffc3ca-64e3-2734-32b1-bc24ae7ceaff" -> null
      - triggers_replace = [
          - "nextjs",
          - "b1ca8024f59cc57128b7b350722c3e58",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/apple-icon.png"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "e2fd9900-2f1e-ec86-71ab-d983603fe2ba" -> null
      - triggers_replace = [
          - "nextjs",
          - "9f3b8defdf0b7fd9ee19216fbd92fa55",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/apple-icon.png/layout"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/apple-icon.png/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ccdc4b01-de23-deae-3d23-818ba5e45baf" -> null
      - triggers_replace = [
          - "nextjs",
          - "976c6f151f5f0a356c1602d9ed0c3088",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/apple-icon.png/route"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/apple-icon.png/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "4f8323af-0cdb-fc15-b2fb-49a499bb1aa8" -> null
      - triggers_replace = [
          - "nextjs",
          - "ba0d4e12dd6f9cac9bcb1bdcb7606258",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/cgv"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "89647507-8934-c9cd-0f37-c0d627d3e315" -> null
      - triggers_replace = [
          - "nextjs",
          - "f25a8013d7f60466bcef6f52fef163f0",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/cgv/layout"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/cgv/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "59d3fb79-82c9-18e8-d3b8-02a2f5063446" -> null
      - triggers_replace = [
          - "nextjs",
          - "c799ec61567f508256f9bc503c677fde",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/cgv/page"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/cgv/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "62017a5c-ca73-97d2-0a37-901bf46724a7" -> null
      - triggers_replace = [
          - "nextjs",
          - "6a30fe0674f47de1191181490752239a",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/favicon.ico"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "d74481e6-9223-4974-131e-9a42f0750782" -> null
      - triggers_replace = [
          - "nextjs",
          - "c17057019f3c0bf48ee2b0992db80fc4",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/favicon.ico/layout"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/favicon.ico/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "2bf5c3a4-3ec9-8a57-6d8b-e59e774d4bce" -> null
      - triggers_replace = [
          - "nextjs",
          - "93d8183a5b429f52a5edcd97ec67ee43",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/favicon.ico/route"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/favicon.ico/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "2d86ece4-3308-b48c-94d2-937a75e263e4" -> null
      - triggers_replace = [
          - "nextjs",
          - "3b40b76306e05363ceb66d9b417721b7",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/icon.svg"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "62e4ae44-8741-c042-8261-5ea9cc607aa2" -> null
      - triggers_replace = [
          - "nextjs",
          - "81a9d0a10a3f1e372ac554e8382a60eb",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/icon.svg/layout"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/icon.svg/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "1c01c793-08a4-5b79-035b-d43e1eb420b4" -> null
      - triggers_replace = [
          - "nextjs",
          - "335e42d0e53abe8384b5a6189a14b43e",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/icon.svg/route"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/icon.svg/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "f3b56f68-21f6-7bbd-98e1-4c5c1669c010" -> null
      - triggers_replace = [
          - "nextjs",
          - "d06e135771013df68ca5d814b6737d14",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/_not-found"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "7c1e1528-4da8-039c-e928-7a4593c837ed" -> null
      - triggers_replace = [
          - "nextjs",
          - "d860059e0427aea3cd0b1eb5a9db665c",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/apple-icon.png"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "aed44db3-c439-beae-2af9-6f30e84e9a32" -> null
      - triggers_replace = [
          - "nextjs",
          - "7ea14267911a8133381977e5de51839d",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/cgv"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ede44a60-9e42-368e-5a08-99f18dc122e2" -> null
      - triggers_replace = [
          - "nextjs",
          - "d0a0d0bd663e66d1698462196e8845f6",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/favicon.ico"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "1368acd4-982f-31a4-6cfc-84ee060e1fa0" -> null
      - triggers_replace = [
          - "nextjs",
          - "af206780fc7b4a166f638b84647d93aa",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/icon.svg"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "74e83015-dfbb-b663-c89e-079070adc117" -> null
      - triggers_replace = [
          - "nextjs",
          - "4fb946aa3b1f5668d7948a1205fb81b3",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/index"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/index"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "83994787-8606-db65-4433-d03dc653d168" -> null
      - triggers_replace = [
          - "nextjs",
          - "db390fc08239d53839643cb291315a3f",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/sitemap.xml"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/layout-1EdMy2c0emGvHVZE3AZtq/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "4b8bed6a-a889-65cc-35d1-5cbcba983064" -> null
      - triggers_replace = [
          - "nextjs",
          - "f151c61b1e216e171c621f77160e469c",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/page"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "790925c4-03af-982c-a302-e372b6f968cb" -> null
      - triggers_replace = [
          - "nextjs",
          - "4fc242e2da4c78787773f7a7d0965dbb",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/sitemap.xml"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "22db2b9c-9790-3fd9-2a9b-e23f24f2a18f" -> null
      - triggers_replace = [
          - "nextjs",
          - "ecd6b36cf18db6d8a0289e4bb15aaea1",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/sitemap.xml/layout"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/sitemap.xml/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "4e793313-1468-fa07-5600-e6fa234cf59c" -> null
      - triggers_replace = [
          - "nextjs",
          - "101984c4ca9c5677d8f83dd0cd6f521d",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["1EdMy2c0emGvHVZE3AZtq/_N_T_/sitemap.xml/route"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_N_T_/sitemap.xml/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "3a2dc5d3-a7eb-c7ce-4127-6f9ad25f9db3" -> null
      - triggers_replace = [
          - "nextjs",
          - "ce3d020a64f919cfd758285b19e2a4eb",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "59a8710c84ea970131a08f0877c05fca",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "d502db4954287e14d09baad8551bcfd6",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/_not-found/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "733da2cfe4fda1b248057d242ebcd42b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/_not-found/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "e3f4cadeb535eb79baf075f386160b6c",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "aa93f221aa6532757ed8bb2019efb8ad",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/apple-icon.png/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "345f3c0a07aa4536e7db65c21fdbfbcc",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/apple-icon.png/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "75669184adf3d76bb13a69bb931f7c48",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "ea8345678e03986444fefee3939f6c7a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/cgv/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "9924e140582ecedebaffe5a39b5a094d",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/cgv/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "894015e3415ebb2c73c4db5c43cbc024",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "849e12094b245b8f9b1a1e16e1f69977",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/favicon.ico/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "6b83b9a46f17d67fdb1770de33dd174c",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/favicon.ico/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "d03f986a9d97c0281c8e6071ba2df170",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "8129f829b57f200ef35cdd24d3f24853",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/icon.svg/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "ca4e3591d3475b8efc458f6ff752ea45",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/icon.svg/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "557a48c5486ec51335103b57291ece0b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/layout-ctJKUtVFFHcOb4KuX4DDY/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "8c11be8ad5931930b1a9fb808482f9b8",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/layout-ctJKUtVFFHcOb4KuX4DDY/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "587751cc75b2290d144940c55ed69df9",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/layout-ctJKUtVFFHcOb4KuX4DDY/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "b30cc787bdfa36d7067769f5ad33d0d9",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/layout-ctJKUtVFFHcOb4KuX4DDY/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "cd703927f5b5459350021f59dc08f4b7",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/layout-ctJKUtVFFHcOb4KuX4DDY/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "653500c30bced1d66064b4cf2e8b54fd",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/layout-ctJKUtVFFHcOb4KuX4DDY/index"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "ee3a51ad36731bc31ca85edfde5bbf79",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/layout-ctJKUtVFFHcOb4KuX4DDY/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "183974b7b8cd672a955cb88be2693ca6",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "f1cac11a7599a350747f45132d6d1b8b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "c9c258cfa28f365f4e268bb188a5cde9",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/sitemap.xml/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "6ec1051b3041f1613588e7dc5ac9899a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ctJKUtVFFHcOb4KuX4DDY/_N_T_/sitemap.xml/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "e3d9c1afb232d51ab442577a10789def",
        ]
    }

  # module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-image-optimization-function"
      ~ last_modified                  = "2025-02-24T15:43:42.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:21" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:21/invocations" -> (known after apply)
      ~ source_code_hash               = "2lBn9MTi09ER/X9DeGz+5PPhu9D0aNwqBPCnuEE7NSA=" -> "i+s7KX5AMZYKim9wQAJJbYWpOUyoAJn7FPE6p+qdUaA="
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "61b6fd4d-844e-7712-5ed4-6a3cb3056c54" -> (known after apply)
      ~ triggers_replace = [
          ~ "21" -> (known after apply),
            "nextjs",
        ]
    }

  # module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-revalidation-function"
      ~ last_modified                  = "2025-02-24T15:43:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:21" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:21/invocations" -> (known after apply)
      ~ source_code_hash               = "iYAimVIEVnGML/AdUHOqKLss1eREaHyXTW0RedfE5a8=" -> "Tqe8fFennm5ymheBv6HcSp0kuYTvWGc/DGF+qD37hCQ="
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.single_zone.module.revalidation_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "263b09c8-895a-2ee4-b293-064ed747e58b" -> (known after apply)
      ~ triggers_replace = [
          ~ "21" -> (known after apply),
            "stable",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/500.cache"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/500.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "fc182b36-f08e-4025-f723-7a5213c9fa14" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "d62544efd08fa2378042b8dda0950b6f",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/_not-found.cache"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/_not-found.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "49f93e7a-a6d5-9be0-3b2f-6a2ce9e8d472" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "49e95a4f3ac3ccdefde59c4821fcd949",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/apple-icon.png.cache"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/apple-icon.png.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "50428d05-e65a-f1d2-11b6-e63bee868587" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9843a61c98627e227286769373becd10",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/cgv.cache"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/cgv.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "cf7e5e26-2fa3-1017-9405-02c5a6c88703" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "e0f94db93d902ed694c5a4303e437226",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/favicon.ico.cache"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/favicon.ico.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "74d91445-2cc2-e7ac-c868-4759854d6217" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "1253a11e7fded511c766a255028ab4ee",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/icon.svg.cache"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/icon.svg.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "1ccaf511-c967-55eb-898d-d77d50a9bed9" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "31e8b96a370a0c0409d732d5d9c1d2d6",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/index.cache"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/index.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "e8a50cf1-70c7-0ae7-e6c7-3e649a98c606" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "01b95b4f01a053c4ae68dd2e53f09683",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["1EdMy2c0emGvHVZE3AZtq/sitemap.xml.cache"] will be destroyed
  # (because key ["1EdMy2c0emGvHVZE3AZtq/sitemap.xml.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "86428616-26ac-f751-53eb-9d91b885e428" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "c306eb32bcce628e7012d383ea54a49d",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"] must be replaced
-/+ resource "terraform_data" "file_sync" {
      ~ id               = "a62f2a6c-f04c-9ae4-1cc3-c40d2cfdf75f" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            "nextjs",
          ~ "effc0e9289f8b5ba6d6a13582170b83a" -> "cc087ab26a646582e4b11e662bec7360",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/1EdMy2c0emGvHVZE3AZtq/_buildManifest.js"] will be destroyed
  # (because key ["_next/static/1EdMy2c0emGvHVZE3AZtq/_buildManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "cd953d10-7d48-69f2-5d26-2f1ee076e489" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9a9bc883f7801dfd30597cebfafa30d0",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/1EdMy2c0emGvHVZE3AZtq/_ssgManifest.js"] will be destroyed
  # (because key ["_next/static/1EdMy2c0emGvHVZE3AZtq/_ssgManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "daeaa53e-505e-7272-f74e-67fc6be59edd" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b404e23d62d95bafd03ad7747cc0e88b",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/ctJKUtVFFHcOb4KuX4DDY/_buildManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9a9bc883f7801dfd30597cebfafa30d0",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/ctJKUtVFFHcOb4KuX4DDY/_ssgManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b404e23d62d95bafd03ad7747cc0e88b",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ctJKUtVFFHcOb4KuX4DDY/500.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "f74fdaaf967bf0c7c34054c169c9f69c",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ctJKUtVFFHcOb4KuX4DDY/_not-found.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "af04daf6915f01ddda386839665a894e",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ctJKUtVFFHcOb4KuX4DDY/apple-icon.png.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9843a61c98627e227286769373becd10",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ctJKUtVFFHcOb4KuX4DDY/cgv.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "61ba881301ff5438cfedda52a48f9556",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ctJKUtVFFHcOb4KuX4DDY/favicon.ico.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "1253a11e7fded511c766a255028ab4ee",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ctJKUtVFFHcOb4KuX4DDY/icon.svg.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "31e8b96a370a0c0409d732d5d9c1d2d6",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ctJKUtVFFHcOb4KuX4DDY/index.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "c067ce5f7cef9556b3370abb8b460c10",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ctJKUtVFFHcOb4KuX4DDY/sitemap.xml.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "2cf04e019afd4c9e891904f190f6619a",
        ]
    }

  # module.single_zone.module.server_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-server-function"
      ~ last_modified                  = "2025-02-24T15:43:53.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:21" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:21/invocations" -> (known after apply)
      ~ source_code_hash               = "DsNUS34BmVWa9MQDqme81cfbDp9EadnxixD+vlDETCk=" -> "6Z4gHRIIZ8ohM+KuKi3CcKEL4q8EsoZAeEBzT7VOvhc="
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.server_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "01927d7d-58b0-93df-31d1-839c889c95aa" -> (known after apply)
      ~ triggers_replace = [
          ~ "21" -> (known after apply),
            "nextjs",
        ]
    }

Plan: 41 to add, 3 to change, 41 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: `terraform`, Workflow: `PR Checks`*